In [1]:
import pandas as pd

In [9]:
df = pd.read_csv("fifa_players_data.csv")                #  for reading data :-  read_csv( location of file ) 
# <data frame object name > to view all data ...this case df is the object

In [6]:
"""
DataFrame(<dictonary>)
creating a data frame using dictonary 
arrays must be of same length 
"""
dict1={
    "Name":["Subodh", "Sanjiv", "Suraj", "Rajiv", "Sudesh", "Milan", "Suman", "Manoj"],
    "Branch":["CSE", "CSE", "CSE", "CSE", "Civil", "CSE", "Civil", "MECH"],
    "Address":["Barangdi", "Tansen", "Kawaseti", "Tansen", "", "Tansen", "Tansen", "Bhairavstan"],
}
df1=pd.DataFrame(dict1)

In [54]:
# df.shape gives rows and  columns and size gives the no of elements in whole dataframe 
print("For df1 \n\nThe shape is \t",df1.shape)
rows, columns = df.shape
print("No of rows is : {0}\nNo of columns  is : {1} \nTotal no of elements is {2}".format(rows, columns, df1.size))
df1

For df1

The shape is 	 (8, 3)
No of rows is : 18207
No of columns  is : 89
Total no of elements is 24

     Name Branch      Address
0  Subodh    CSE     Barangdi
1  Sanjiv    CSE       Tansen
2   Suraj    CSE     Kawaseti
3   Rajiv    CSE       Tansen
4  Sudesh  Civil
5   Milan    CSE       Tansen
6   Suman  Civil       Tansen
7   Manoj   MECH  Bhairavstan

In [33]:
"""df.columns-- fpr titles in dataframe
df.head( <no of elements from first> )
df.tail( <no of elements from last > )
df[:] -- all
df[m:n]  ---  from m rows to n rows .... n exclusive"""
df1[1:3]

     Name Branch      Address
4  Sudesh  Civil
5   Milan    CSE       Tansen
6   Suman  Civil       Tansen
7   Manoj   MECH  Bhairavstan

In [34]:
df1.head(4)

     Name Branch   Address
0  Subodh    CSE  Barangdi
1  Sanjiv    CSE    Tansen
2   Suraj    CSE  Kawaseti
3   Rajiv    CSE    Tansen

In [35]:
df1.tail(4)

     Name Branch      Address
4  Sudesh  Civil
5   Milan    CSE       Tansen
6   Suman  Civil       Tansen
7   Manoj   MECH  Bhairavstan

In [38]:
df1.shape

(8, 3)